---
kind: property
id: P:Autodesk.Revit.DB.Lighting.SpotLightDistribution.TiltAngle
source: html/574cd69c-8872-4cf1-4f53-16589c899fa4.htm
---
# Autodesk.Revit.DB.Lighting.SpotLightDistribution.TiltAngle Property

The tilt angle.

## Syntax (C#)
```csharp
public double TiltAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The angle is not valid because it is not between -180.0 and 180.0.